---
kind: type
id: T:Autodesk.Revit.DB.TilePatternsBuiltIn
source: html/5418b933-518e-3ceb-f2d5-40b60409a705.htm
---
# Autodesk.Revit.DB.TilePatternsBuiltIn

Revit's built-in tile patterns.
See TilePattern .

## Syntax (C#)
```csharp
public enum TilePatternsBuiltIn
```